niveis/diagramas.md
```mermaid
graph LR
  linkStyle default fill:#ffffff

  subgraph diagram ["Sistema de Internet Banking - System Context"]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>Cliente bancário pessoal</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Um cliente do banco, com<br />contas pessoais.</div>"]
    style 1 fill:#08427b,stroke:#052e56,color:#ffffff
    2("<div style='font-weight: bold'>Sistema de Internet Banking</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Permite que o cliente<br />visualize informações sobre<br />suas contas bancárias e faça<br />pagamentos.</div>")
    style 2 fill:#1168bd,stroke:#0b4884,color:#ffffff
    33("<div style='font-weight: bold'>Sistema de E-mail</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>O sistema de email interno<br />Microsoft Exchange.</div>")
    style 33 fill:#999999,stroke:#6b6b6b,color:#ffffff
    38("<div style='font-weight: bold'>Sistema Bancário Mainframe</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Armazena todas as informações<br />bancárias básicas sobre<br />clientes, contas, transações<br />etc.</div>")
    style 38 fill:#999999,stroke:#6b6b6b,color:#ffffff

    1-. "<div>Vê os saldos das contas e faz<br />pagamentos usando</div><div style='font-size: 70%'></div>" .->2
    33-. "<div>Envia e-mail para</div><div style='font-size: 70%'></div>" .->1
    2-. "<div>Envia e-mail usando</div><div style='font-size: 70%'></div>" .->33
    2-. "<div>Obtém informações da conta e<br />faz pagamentos usando</div><div style='font-size: 70%'></div>" .->38
  end
```
